In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import statsmodels.api as sm
import seaborn as sns
sns.set()

In [5]:
raw_data = pd.read_csv('2.01. Admittance.csv')

In [6]:
raw_data

      SAT Admitted
0    1363       No
1    1792      Yes
2    1954      Yes
3    1653       No
4    1593       No
..    ...      ...
163  1722      Yes
164  1750      Yes
165  1555       No
166  1524       No
167  1461       No

[168 rows x 2 columns]

In [12]:
data = raw_data

In [14]:
data['Admitted'] = data['Admitted'].map({'Yes':1, 'No':0})

In [15]:
data

      SAT  Admitted
0    1363         0
1    1792         1
2    1954         1
3    1653         0
4    1593         0
..    ...       ...
163  1722         1
164  1750         1
165  1555         0
166  1524         0
167  1461         0

[168 rows x 2 columns]

In [16]:
y = data['Admitted']
x1 = data['SAT']

## Regression

In [ ]:
x = sm.add_constant(x1)
reg_log = sm.Logit(y,x)
reg_